Config/InformationRegisters/СоответствияАналитическихСчетовКЭК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствияАналитическихСчетовКЭК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ВидыКБК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыКБК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>гКБК</Name>
					<Comment>Глава по БК</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КРБ</Name>
					<Comment>Классификация расходов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КДБ</Name>
					<Comment>Классификация доходов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КИФ</Name>
					<Comment>Классификация источников финансирования дефицита бюджетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АУИБУ</Name>
					<Comment>Для АУ и БУ начиная с 01.01.2017</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ПроверкиСостоянияСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПроверкиСостоянияСистемы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗаданиеGUID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗаданиеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВажностьПроблемыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДополнительныхПараметров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоОтдельномуРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеПараметрыАвтопроверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/ChartsOfAccounts/ЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfAccounts>
		<Properties>
			<Name>ЕПСБУ</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КОСГУДт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КОСГУКт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезДетализацииКОСГУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляКазенных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляБюджетных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляАвтономных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьНеУказыватьПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоКПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоКЭК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>НалоговыйУчетНеУчитываемых</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>НалоговыйУчетЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>НалоговыйУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Суммовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

Config/CommonModules/АудитСостоянияСистемыБГУ/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема «Аудит состояния системы».
// Переопределяемые процедуры и функции.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Метод предназначен для описания алгоритма выполнения прикладной
// проверки состояния аудита системы.
//
// Параметры:
//	ИдентификаторПроверки - Строка - Строка, указанная при регистрации проверки, 
//		см. АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы.
//	Выполнена - Булево - если прикладная проверка выполнена, 
//		следует установить значение Истина.
//	ОписаниеПроблем - Таблица значений - предназначена для заполнения информации о выявленных проблемах.
//	 	* Представление - Строка - пользовательское представление проблемы,
//		* Объекты - Массив - Массив объектов информационной базы, однозначно идентифицирующих проблему.
//		* Важность - ПеречислениеСсылка.ВажностьПроблемыУчета,
//		* ДополнительнаяИнформация - ХранилищеЗначения - произвольные сведения, связанные с проблемой,
//
Процедура ВыполнитьПроверкуСостоянияСистемы(ИдентификаторПроверки, Выполнена, ОписаниеПроблем, ЗначенияДопПараметров) Экспорт
	
	МенеджерОбработки = Обработки.АудитСостоянияСистемыБГУ;
	Если ИдентификаторПроверки = "ПроверкаКорректностиКорреспонденцийСчетов" Тогда
		МенеджерОбработки.ПроверкаКорректностиКорреспонденцийСчетов(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаПустыхСубконто" Тогда
		МенеджерОбработки.ПроверкаПустыхСубконто(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаХарактеристикДвижения" Тогда
		МенеджерОбработки.ПроверкаХарактеристикДвижения(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаНаличияСчетаВРПС" Тогда
		МенеджерОбработки.ПроверкаНаличияСчетаВРПС(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаКЭККорреспонденцийОборотовИОстатков" Тогда
		МенеджерОбработки.ПроверкаКЭККорреспонденцийОборотовИОстатков(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаСоответствияКЭКпоДоходамРасходам" Тогда
		МенеджерОбработки.ПроверкаСоответствияКЭКпоДоходамРасходам(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаПоКЭКОборотовСчета21003" Тогда
		МенеджерОбработки.ПроверкаПоКЭКОборотовСчета21003(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаСоответствияВидовРасходовКРБиКОСГУ" Тогда
		МенеджерОбработки.ПроверкаСоответствияВидовРасходовКРБиКОСГУ(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаКодовСчетовБУИАналитКодовВидовПостВыб" Тогда
		МенеджерОбработки.ПроверкаКодовСчетовБУИАналитКодовВидовПостВыб(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаОстатковПоСчетамЕПСБУ" Тогда
		МенеджерОбработки.ПроверкаОстатковПоСчетамЕПСБУ(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаСпециальныхСчетов" Тогда
		МенеджерОбработки.ПроверкаСпециальныхСчетов(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "СравнениеОборотовДСиЗабалансовыхСчетов17_18" Тогда
		МенеджерОбработки.СравнениеОборотовДСиЗабалансовыхСчетов17_18(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаУстаревшихСчетов" Тогда
		МенеджерОбработки.ПроверкаУстаревшихСчетов(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаОборотовВнеДействияУчетнойПолитики" Тогда
		МенеджерОбработки.ПроверкаОборотовВнеДействияУчетнойПолитики(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаЛБОНазначенияОбязательстваИсполнение" Тогда
		МенеджерОбработки.ПроверкаЛБОНазначенияОбязательстваИсполнение(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаРегистровУчетаНФА" Тогда
		МенеджерОбработки.ПроверкаРегистровУчетаНФА(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаРегистровУчетаНФАЗабаланс" Тогда
		МенеджерОбработки.ПроверкаРегистровУчетаНФАЗабаланс(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаИнвентарныхНомеров" Тогда
		МенеджерОбработки.ПроверкаИнвентарныхНомеров(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "НалоговаяБазаИмущества" Тогда
		МенеджерОбработки.НалоговаяБазаИмущества(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаКЭКпоДебетуИКредиту" Тогда
		МенеджерОбработки.ПроверкаКЭКпоДебетуИКредиту(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаДопустимыхКЭК" Тогда
		МенеджерОбработки.ПроверкаДопустимыхКЭК(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаСправочникаКЭК" Тогда
		МенеджерОбработки.ПроверкаСправочникаКЭК(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаПланаСчетовЕПСБУ" Тогда
		МенеджерОбработки.ПроверкаПланаСчетовЕПСБУ(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаПризнаковУчетаСчетовБУиНУ" Тогда
		МенеджерОбработки.ПроверкаПризнаковУчетаСчетовБУиНУ(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	ИначеЕсли ИдентификаторПроверки = "ПроверкаВидаКПСКорреспонденций" Тогда
		МенеджерОбработки.ПроверкаВидаКПСКорреспонденций(Выполнена, ОписаниеПроблем, ЗначенияДопПараметров);
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестный вид проверки: %1'"), ИдентификаторПроверки);
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьГруппыПроверок() Экспорт
	
	Если Справочники.ПроверкиСостоянияСистемы.НайтиПоКоду("ИспользованиеСчетовИСубконто") = Справочники.ПроверкиСостоянияСистемы.ПустаяСсылка() Тогда
		
		НоваяГруппа = Справочники.ПроверкиСостоянияСистемы.СоздатьГруппу();
		НоваяГруппа.Код = "ИспользованиеСчетовИСубконто";
		НоваяГруппа.Наименование = "Использование счетов и субконто";
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НоваяГруппа);
		
	КонецЕсли;
	
	Если Справочники.ПроверкиСостоянияСистемы.НайтиПоКоду("ИспользованиеБюджетныхКлассификаторов") = Справочники.ПроверкиСостоянияСистемы.ПустаяСсылка() Тогда
		
		НоваяГруппа = Справочники.ПроверкиСостоянияСистемы.СоздатьГруппу();
		НоваяГруппа.Код = "ИспользованиеБюджетныхКлассификаторов";
		НоваяГруппа.Наименование = "Использование бюджетных классификаторов";
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НоваяГруппа);
		
	КонецЕсли;
	
	Если Справочники.ПроверкиСостоянияСистемы.НайтиПоКоду("ОстаткиИОборотыПоСчетам") = Справочники.ПроверкиСостоянияСистемы.ПустаяСсылка() Тогда
		
		НоваяГруппа = Справочники.ПроверкиСостоянияСистемы.СоздатьГруппу();
		НоваяГруппа.Код = "ОстаткиИОборотыПоСчетам";
		НоваяГруппа.Наименование = "Остатки и обороты по счетам";
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НоваяГруппа);
		
	КонецЕсли;
	
	Если Справочники.ПроверкиСостоянияСистемы.НайтиПоКоду("ИсполнениеБюджетаПФХД") = Справочники.ПроверкиСостоянияСистемы.ПустаяСсылка() Тогда
		
		НоваяГруппа = Справочники.ПроверкиСостоянияСистемы.СоздатьГруппу();
		НоваяГруппа.Код = "ИсполнениеБюджетаПФХД";
		НоваяГруппа.Наименование = "Исполнение бюджета / плана ФХД";
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НоваяГруппа);
		
	КонецЕсли;
	
	Если Справочники.ПроверкиСостоянияСистемы.НайтиПоКоду("УчетНФА") = Справочники.ПроверкиСостоянияСистемы.ПустаяСсылка() Тогда
		
		НоваяГруппа = Справочники.ПроверкиСостоянияСистемы.СоздатьГруппу();
		НоваяГруппа.Код = "УчетНФА";
		НоваяГруппа.Наименование = "Учет нефинансовых активов";
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НоваяГруппа);
		
	КонецЕсли;
	
	Если Справочники.ПроверкиСостоянияСистемы.НайтиПоКоду("НастройкиПланаСчетов") = Справочники.ПроверкиСостоянияСистемы.ПустаяСсылка() Тогда
		
		НоваяГруппа = Справочники.ПроверкиСостоянияСистемы.СоздатьГруппу();
		НоваяГруппа.Код = "НастройкиПланаСчетов";
		НоваяГруппа.Наименование = "Настройки плана счетов";
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НоваяГруппа);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьПроверкиСостоянияСистемы() Экспорт
	
	ОписаниеДополнительныхПараметров = АудитСостоянияСистемы.ТаблицаДополнительныхПараметровПроверки();
	
	НовыйПараметр = ОписаниеДополнительныхПараметров.Добавить();
	НовыйПараметр.ТипПараметра 					= "СтандартныйПериод";
	НовыйПараметр.ИмяПараметра 					= "Период";
	НовыйПараметр.Заголовок 					= "Период";
	НовыйПараметр.ЗначениеПоУмолчанию 			= Новый СтандартныйПериод(ВариантСтандартногоПериода.СНачалаЭтогоГода);
	НовыйПараметр.ИспользуетсяДляАвтопроверки 	= Истина;
	
	НовыйПараметр = ОписаниеДополнительныхПараметров.Добавить();
	НовыйПараметр.ТипПараметра 					= "СправочникСсылка.Организации";
	НовыйПараметр.ИмяПараметра 					= "Организация";
	НовыйПараметр.Заголовок 					= "Организация";
	НовыйПараметр.ЗначениеПоУмолчанию 			= ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
	
	ПараметрыРегистрации = АудитСостоянияСистемы.СтруктураПараметровПроверкиСостоянияСистемы();
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаКорректностиКорреспонденцийСчетов");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Некорректные корреспонденции счетов'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка проводок на наличие корреспонденций, не согласующихся с корректными корреспонденциями счетов.'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Информация"));
	ПараметрыРегистрации.Вставить("Группа", "ИспользованиеСчетовИСубконто");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаПустыхСубконто");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Пустые субконто'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка проводок на наличие счетов с незаполненными субконто.
												|Проверка производится только тех субконто, которые не могут иметь пустого значения.'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Информация"));
	ПараметрыРегистрации.Вставить("Группа", "ИспользованиеСчетовИСубконто");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации); 
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаНаличияСчетаВРПС");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Наличие счетов в РПС'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка проводок на наличие счетов, отсутствующих в Рабочем плане счетов.'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Предупреждение"));
	ПараметрыРегистрации.Вставить("Группа", "ИспользованиеСчетовИСубконто");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаХарактеристикДвижения");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Характеристики движения'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка проводок на корректность заполнения характеристик движения по дебету/кредиту:
												|- проверка заполненности характеристики движения к счетам 201 и 210.03 значением целевого КЭК (используется при заполнения формы 0503123)'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Предупреждение"));
	ПараметрыРегистрации.Вставить("Группа", "ИспользованиеСчетовИСубконто");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаВидаКПСКорреспонденций");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Виды КПС корреспонденций'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка проводок и остатков на начало периода на соответствие счетов виду КПС, а также поиск счетов с незаполненным КПС.
												|Проверка производится только в рамках источников средств (ИФО и КФО), по которым на рабочих счетах используется бюджетная классификация.'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Предупреждение"));
	ПараметрыРегистрации.Вставить("Группа", "ИспользованиеБюджетныхКлассификаторов");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаКЭККорреспонденцийОборотовИОстатков");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'КЭК корреспонденций'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка проводок на соответствие счета КЭК с учетом стороны проводки, а также проверка остатков на начало периода.
												|Проверка производится только в рамках источников средств (ИФО и КФО), по которым на рабочих счетах используется бюджетная классификация.'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Предупреждение"));
	ПараметрыРегистрации.Вставить("Группа", "ИспользованиеБюджетныхКлассификаторов");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаСоответствияКЭКпоДоходамРасходам");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Соответствие КЭК по доходам/расходам'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка операций, в которых есть счета 205, 206, 208, 209, 302 на корректность использования КЭК корреспондирующих счетов (401.10, 401.20, 401.40, 401.50, 210.02, 210.04, 109, 304.05, 201.11, 201.13, 201.21, 201.23, 201.34).'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Предупреждение"));
	ПараметрыРегистрации.Вставить("Группа", "ИспользованиеБюджетныхКлассификаторов");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаСоответствияВидовРасходовКРБиКОСГУ");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Соответствие видов расходов КРБ и КОСГУ'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка проводок на соответствие видов расходов КРБ и КОСГУ.
												|Анализируются операции с КПС вида КРБ и счетами, отражающими исполнение расходов (304.05, 18).'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Предупреждение"));
	ПараметрыРегистрации.Вставить("Группа", "ИспользованиеБюджетныхКлассификаторов");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаКодовСчетовБУИАналитКодовВидовПостВыб");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Коды счетов БУ и аналит. коды видов поступлений / выбытий'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка проводок на корректность кодов аналитических счетов бюджетного учета и видов расходов (аналитических кодов видов поступлений и выбытий) бюджетной классификации РФ.
												|Проверка осуществляется для счетов расчетов.'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Информация"));
	ПараметрыРегистрации.Вставить("Группа", "ИспользованиеБюджетныхКлассификаторов");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаПоКЭКОборотовСчета21003");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'КЭК оборотов счета 210.03'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка по КЭК оборотов счета 210.03:
												|Обороты за период по дебету счета 210.03 должны быть равны обороту по кредиту в рамках каждого значения КЭК, по которому были обороты.'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Ошибка"));
	ПараметрыРегистрации.Вставить("Группа", "ИспользованиеБюджетныхКлассификаторов");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаОстатковПоСчетамЕПСБУ");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Остатки по счетам ЕПСБУ'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка остатков на конец периода по счетам ЕПСБУ на их корректность.
												|Анализируются остатки по счетам: 101, 102, 103, 105, 108, 111, 205.хА, 206, 302, 21.'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Предупреждение"));
	ПараметрыРегистрации.Вставить("Группа", "ОстаткиИОборотыПоСчетам");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаПризнаковУчетаСчетовБУиНУ");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Признаки аналитического учета'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка признаков аналитического учета (валютный учет, учет по подразделениям) на связанных счетах бухгалтерского учета.'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Информация"));
	ПараметрыРегистрации.Вставить("Группа", "ИспользованиеСчетовИСубконто");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаСпециальныхСчетов");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = '""Специальные счета"" 401.30 и 000'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка «Специальных Счетов»: 
												|- 401.30 на наличие оборотов в текущем периоде за исключением сделанных регламентными документами закрытия периода.
												|- 000 на ненулевые остатки на начало периода, а также на наличие оборотов в текущем периоде за исключением сделанных регламентными документами закрытия периода.'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Ошибка"));
	ПараметрыРегистрации.Вставить("Группа", "ОстаткиИОборотыПоСчетам");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "СравнениеОборотовДСиЗабалансовыхСчетов17_18");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Обороты счетов денежных средств и заб. счетов 17, 18'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Сравнение оборотов счетов 201.11, 201.13, 201.21, 201.23, 201.26, 201.27, 201.34, 210.03 и оборотов по счетам 17 и 18 на выполнение следующих контрольных соотношений:
												|- Обороты по дебету и кредиту счетов 201.11, 201.21 = обороты по дебету и кредиту счетов 17.01 и 18.01
												|- Обороты по дебету и кредиту счетов 201.13, 201.23 = обороты по дебету и кредиту счетов 17.03 и 18.03
												|- Обороты по дебету и кредиту счета 201.26 = обороты по дебету и кредиту счетов 17.06 и 18.06
												|- Обороты по дебету и кредиту счета 201.27 = обороты по дебету и кредиту счетов 17.07 и 18.07
												|- Обороты по дебету и кредиту счета 201.34 = обороты по дебету и кредиту счетов 17.34 и 18.34
												|- Обороты по дебету и кредиту счета 210.03 = обороты по дебету и кредиту счетов 17.30 и 18.30'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Ошибка"));
	ПараметрыРегистрации.Вставить("Группа", "ОстаткиИОборотыПоСчетам");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаУстаревшихСчетов");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Устаревшие счета'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка остатков на начало периода и проводок на наличие устаревших счетов.'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Ошибка"));
	ПараметрыРегистрации.Вставить("Группа", "ОстаткиИОборотыПоСчетам");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаОборотовВнеДействияУчетнойПолитики");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Обороты вне действия учетной политики'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка регистра бухгалтерии на наличие движений с периодом, ранее начала действия первой учетной политики организации.'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Ошибка"));
	ПараметрыРегистрации.Вставить("Группа", "ОстаткиИОборотыПоСчетам");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаЛБОНазначенияОбязательстваИсполнение");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'ЛБО / Ассигнования / Плановые назначения, обязательства, исполнение'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка показателей исполнения бюджета / плана ФХД на нарушение неравенств:
												|ЛБО / Ассигнования / Плановые назаначения >= Принятые обязательства >= Принятые денежные обязательства >= Исполненные обязательства.
												|Проверку необходимо выполнять за период с начала года.'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Предупреждение"));
	ПараметрыРегистрации.Вставить("Группа", "ИсполнениеБюджетаПФХД");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаРегистровУчетаНФА");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Регистры учета НФА'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка соответствия данных об остатках и движениях НФА по бухгалтерским счетам и регистрам учета:
												|- Данные счетов 101, 102, 103, 108, 111.60 = Данные регистра ""Стоимость объектов ОС, НМА, НПА""
												|- Данные счетов 104, 114 = Данные регистра ""Амортизация, обесценение объектов ОС, НМА, НПА""
												|- Данные счетов 106 = Данные регистра ""Операции капвложений""
												|- Данные счетов НФА = Данные регистров учета драгматериалов'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Предупреждение"));
	ПараметрыРегистрации.Вставить("Группа", "УчетНФА");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаРегистровУчетаНФАЗабаланс");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Регистры учета НФА (забаланс)'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка соответствия данных об остатках и движениях НФА по бухгалтерским счетам и регистрам учета:
												|- Данные счета 21 = Данные регистра ""Стоимость объектов ОС, НМА, НПА""
												|- Данные счетов 01, 02, 25, 26 = Данные регистра ""Стоимость объектов ОС, НМА, НПА (по контрагентам)""
												|- Данные счета 03 = Данные регистра ""Движения БСО""'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Предупреждение"));
	ПараметрыРегистрации.Вставить("Группа", "УчетНФА");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаИнвентарныхНомеров");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Инвентарные номера'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка использования (неиспользования) инвентарного номера в регистрах учета НФА:
												|- По одному объекту основных средств в регистрах учета одновременно не должно быть записей с заполненным и незаполненным инвентарным номером
												|- В записях регистров учета инвентарный номер должен соответствовать объекту НФА из этой же записи'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Предупреждение"));
	ПараметрыРегистрации.Вставить("Группа", "УчетНФА");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "НалоговаяБазаИмущества");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Налоговая база имущества'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка учета имущества в налоговых органах по данным регистра сведений ""Ставки налога на имущество"":
												|- По имуществу не должно быть нескольких регистраций оформленных одной датой и временем (кроме учета в долях стоимости)
												|- При учете имущества в долях стоимости в разных налоговых органах сумма долей должна быть равна единице.'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Ошибка"));
	ПараметрыРегистрации.Вставить("Группа", "УчетНФА");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ОписаниеДополнительныхПараметров.Очистить(); // ниже идут проверки без параметров
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаКЭКпоДебетуИКредиту");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'КЭК по дебету и кредиту'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка плана счетов (ЕПСБУ) на корректность КЭК по дебету и кредиту счета'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Ошибка"));
	ПараметрыРегистрации.Вставить("Группа", "НастройкиПланаСчетов");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаДопустимыхКЭК");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Допустимые КЭК'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка плана счетов (ЕПСБУ) на корректность КЭК счетов'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Предупреждение"));
	ПараметрыРегистрации.Вставить("Группа", "НастройкиПланаСчетов");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаСправочникаКЭК");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'Справочник ""КЭК""'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка справочника ""КЭК"" на наличие дублей по коду и нарушение иерархии элементов'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Предупреждение"));
	ПараметрыРегистрации.Вставить("Группа", "НастройкиПланаСчетов");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
	ПараметрыРегистрации.Вставить("Идентификатор", "ПроверкаПланаСчетовЕПСБУ");
	ПараметрыРегистрации.Вставить("Название", НСтр("ru = 'План счетов ""ЕПСБУ""'"));
	ПараметрыРегистрации.Вставить("Комментарий", НСтр("ru = 'Проверка бухгалтерских балансовых счетов ЕПСБУ на нарушение иерархии элементов по синтетическому коду счета'"));
	ПараметрыРегистрации.Вставить("Важность", ПредопределенноеЗначение("Перечисление.ВажностьПроблемыУчета.Ошибка"));
	ПараметрыРегистрации.Вставить("Группа", "НастройкиПланаСчетов");
	ПараметрыРегистрации.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
	ПараметрыРегистрации.Вставить("Используется", Ложь);
	
	АудитСостоянияСистемы.ЗарегистрироватьПроверкуСостоянияСистемы(ПараметрыРегистрации);
	
КонецПроцедуры

Функция СформироватьТаблицуСчет_ВидКБК() Экспорт
	
	ТаблицаНастроек = Новый ТаблицаЗначений;
	ТаблицаНастроек.Колонки.Добавить("КодСчета", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
	ТаблицаНастроек.Колонки.Добавить("ВидКБК", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКБК"));
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеСчетов = ПланыСчетов.ЕПСБУ.ПолучитьДанныеСчетов(,"Код,ВидыКПС");
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Каждого ДанныеСчета Из ДанныеСчетов Цикл
		Для Каждого ВидКПС Из ДанныеСчета.ВидыКПС Цикл
			НоваяСтрока = ТаблицаНастроек.Добавить();
			НоваяСтрока.КодСчета = ДанныеСчета.Код;
			НоваяСтрока.ВидКБК = ВидКПС;
		КонецЦикла;
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Таб.КодСчета,
	|	Таб.ВидКБК
	|ПОМЕСТИТЬ ТабНастроек
	|ИЗ
	|	&ТаблицаНастроек КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕПСБУ.Ссылка КАК Счет,
	|	ТабНастроек.ВидКБК
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабНастроек КАК ТабНастроек
	|		ПО (ПОДСТРОКА(ЕПСБУ.Код, 1, 6) = ТабНастроек.КодСчета)
	|ГДЕ
	|	НЕ ЕПСБУ.ЭлементГруппа";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТаблицаНастроек", ТаблицаНастроек);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СформироватьТаблицыКОСГУ_Счет(ПроверкаРегистраБухгалтерии = Истина, НаДату = Неопределено) Экспорт
	
	ТаблицаНастроекКОСГУ = Новый ТаблицаЗначений;
	ТаблицаНастроекКОСГУ.Колонки.Добавить("КодСчета", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(6)));
	ТаблицаНастроекКОСГУ.Колонки.Добавить("КОСГУ", Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ТаблицаНастроекКОСГУ.Колонки.Добавить("ДатаНачалаДействия", Новый ОписаниеТипов("Дата"));
	ТаблицаНастроекКОСГУ.Колонки.Добавить("ДатаОкончанияДействия", Новый ОписаниеТипов("Дата"));
	
	ТаблицаНастроекКОСГУДт = Новый ТаблицаЗначений;
	ТаблицаНастроекКОСГУДт.Колонки.Добавить("КодСчета", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(6)));
	ТаблицаНастроекКОСГУДт.Колонки.Добавить("КОСГУДт", Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ТаблицаНастроекКОСГУДт.Колонки.Добавить("ДатаНачалаДействия", Новый ОписаниеТипов("Дата"));
	ТаблицаНастроекКОСГУДт.Колонки.Добавить("ДатаОкончанияДействия", Новый ОписаниеТипов("Дата"));
	
	ТаблицаНастроекКОСГУКт = Новый ТаблицаЗначений;
	ТаблицаНастроекКОСГУКт.Колонки.Добавить("КодСчета", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(6)));
	ТаблицаНастроекКОСГУКт.Колонки.Добавить("КОСГУКт", Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ТаблицаНастроекКОСГУКт.Колонки.Добавить("ДатаНачалаДействия", Новый ОписаниеТипов("Дата"));
	ТаблицаНастроекКОСГУКт.Колонки.Добавить("ДатаОкончанияДействия", Новый ОписаниеТипов("Дата"));
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеСчетов = ПланыСчетов.ЕПСБУ.ПолучитьДанныеСчетов(,"ДатаНачалаДействия,ДатаОкончанияДействия,КОСГУДт,КОСГУКт,ВидыКЭК");
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Каждого ДанныеСчета Из ДанныеСчетов Цикл
		
		Для Каждого СтрокаКЭК Из ДанныеСчета.ВидыКЭК Цикл
			НоваяСтрока = ТаблицаНастроекКОСГУ.Добавить();
			НоваяСтрока.КодСчета 				= ДанныеСчета.Код;
			НоваяСтрока.КОСГУ 					= СтрокаКЭК.КЭК;
			НоваяСтрока.ДатаНачалаДействия 		= ДанныеСчета.ДатаНачалаДействия;
			НоваяСтрока.ДатаОкончанияДействия 	= ДанныеСчета.ДатаОкончанияДействия;
		КонецЦикла;
		
		Если НЕ ДанныеСчета.КОСГУДт.Пустая() Тогда
			НоваяСтрока = ТаблицаНастроекКОСГУДт.Добавить();
			НоваяСтрока.КодСчета 				= ДанныеСчета.Код;
			НоваяСтрока.КОСГУДт 				= ДанныеСчета.КОСГУДт;
			НоваяСтрока.ДатаНачалаДействия 		= ДанныеСчета.ДатаНачалаДействия;
			НоваяСтрока.ДатаОкончанияДействия 	= ДанныеСчета.ДатаОкончанияДействия;
		КонецЕсли;
		
		Если НЕ ДанныеСчета.КОСГУКт.Пустая() Тогда
			НоваяСтрока = ТаблицаНастроекКОСГУКт.Добавить();
			НоваяСтрока.КодСчета 				= ДанныеСчета.Код;
			НоваяСтрока.КОСГУКт 				= ДанныеСчета.КОСГУКт;
			НоваяСтрока.ДатаНачалаДействия 		= ДанныеСчета.ДатаНачалаДействия;
			НоваяСтрока.ДатаОкончанияДействия 	= ДанныеСчета.ДатаОкончанияДействия;
		КонецЕсли;
		
		// при проверке РБ для счетов группы 104 добавим КОСГУДт/Кт 410 и 420, использовавшиеся до 01.01.2018, для совместимости
		Если ЗначениеЗаполнено(НаДату) И НаДату < Дата(2018, 1, 1)
			И ПроверкаРегистраБухгалтерии И Лев(ДанныеСчета.Код, 3) = "104" Тогда
			
			Если ДанныеСчета.Код = "104.29" ИЛИ ДанныеСчета.Код = "104.39" Тогда
				КОСГУОборотное = БухгалтерскийУчетПовтИсп.КЭКПоКоду("420");
			Иначе
				КОСГУОборотное = БухгалтерскийУчетПовтИсп.КЭКПоКоду("410");
			КонецЕсли;
			
			НоваяСтрока = ТаблицаНастроекКОСГУ.Добавить();
			НоваяСтрока.КодСчета 				= ДанныеСчета.Код;
			НоваяСтрока.КОСГУ 					= КОСГУОборотное;
			НоваяСтрока.ДатаНачалаДействия 		= ДанныеСчета.ДатаНачалаДействия;
			НоваяСтрока.ДатаОкончанияДействия 	= ДанныеСчета.ДатаОкончанияДействия;
			
			НоваяСтрока = ТаблицаНастроекКОСГУДт.Добавить();
			НоваяСтрока.КодСчета 				= ДанныеСчета.Код;
			НоваяСтрока.КОСГУДт 				= КОСГУОборотное;
			НоваяСтрока.ДатаНачалаДействия 		= ДанныеСчета.ДатаНачалаДействия;
			НоваяСтрока.ДатаОкончанияДействия 	= ДанныеСчета.ДатаОкончанияДействия;
			
			НоваяСтрока = ТаблицаНастроекКОСГУКт.Добавить();
			НоваяСтрока.КодСчета 				= ДанныеСчета.Код;
			НоваяСтрока.КОСГУКт 				= КОСГУОборотное;
			НоваяСтрока.ДатаНачалаДействия 		= ДанныеСчета.ДатаНачалаДействия;
			НоваяСтрока.ДатаОкончанияДействия 	= ДанныеСчета.ДатаОкончанияДействия;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НаДату) И НаДату < Дата(2021, 1, 1)
			И ПроверкаРегистраБухгалтерии И Лев(ДанныеСчета.Код, 6) = "304.03" Тогда
			
			КОСГУДт = БухгалтерскийУчетПовтИсп.КЭКПоКоду("830");
			КОСГУКт = БухгалтерскийУчетПовтИсп.КЭКПоКоду("730");
			
			НоваяСтрока = ТаблицаНастроекКОСГУ.Добавить();
			НоваяСтрока.КодСчета 				= ДанныеСчета.Код;
			НоваяСтрока.КОСГУ 					= КОСГУДт;
			НоваяСтрока.ДатаНачалаДействия 		= ДанныеСчета.ДатаНачалаДействия;
			НоваяСтрока.ДатаОкончанияДействия 	= ДанныеСчета.ДатаОкончанияДействия;
			
			НоваяСтрока = ТаблицаНастроекКОСГУ.Добавить();
			НоваяСтрока.КодСчета 				= ДанныеСчета.Код;
			НоваяСтрока.КОСГУ 					= КОСГУКт;
			НоваяСтрока.ДатаНачалаДействия 		= ДанныеСчета.ДатаНачалаДействия;
			НоваяСтрока.ДатаОкончанияДействия 	= ДанныеСчета.ДатаОкончанияДействия;
			
			НоваяСтрока = ТаблицаНастроекКОСГУДт.Добавить();
			НоваяСтрока.КодСчета 				= ДанныеСчета.Код;
			НоваяСтрока.КОСГУДт 				= КОСГУДт;
			НоваяСтрока.ДатаНачалаДействия 		= ДанныеСчета.ДатаНачалаДействия;
			НоваяСтрока.ДатаОкончанияДействия 	= ДанныеСчета.ДатаОкончанияДействия;
			
			НоваяСтрока = ТаблицаНастроекКОСГУКт.Добавить();
			НоваяСтрока.КодСчета 				= ДанныеСчета.Код;
			НоваяСтрока.КОСГУКт 				= КОСГУКт;
			НоваяСтрока.ДатаНачалаДействия 		= ДанныеСчета.ДатаНачалаДействия;
			НоваяСтрока.ДатаОкончанияДействия 	= ДанныеСчета.ДатаОкончанияДействия;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаНастроекКОСГУ.Свернуть("КодСчета,КОСГУ,ДатаНачалаДействия,ДатаОкончанияДействия");
	ТаблицаНастроекКОСГУДт.Свернуть("КодСчета,КОСГУДт,ДатаНачалаДействия,ДатаОкончанияДействия");
	ТаблицаНастроекКОСГУКт.Свернуть("КодСчета,КОСГУКт,ДатаНачалаДействия,ДатаОкончанияДействия");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Таб.КодСчета КАК КодСчета,
	|	Таб.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	Таб.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	Таб.КОСГУ КАК КОСГУ
	|ПОМЕСТИТЬ ВнешняяТаблицаНастроекКОСГУ
	|ИЗ
	|	&ТаблицаНастроекКОСГУ КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.КодСчета КАК КодСчета,
	|	Таб.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	Таб.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	Таб.КОСГУДт КАК КОСГУДт
	|ПОМЕСТИТЬ ВнешняяТаблицаНастроекКОСГУДт
	|ИЗ
	|	&ТаблицаНастроекКОСГУДт КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.КодСчета КАК КодСчета,
	|	Таб.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	Таб.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	Таб.КОСГУКт КАК КОСГУКт
	|ПОМЕСТИТЬ ВнешняяТаблицаНастроекКОСГУКт
	|ИЗ
	|	&ТаблицаНастроекКОСГУКт КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОСГУ.Ссылка КАК Ссылка,
	|	КОСГУ.Родитель КАК Родитель
	|ПОМЕСТИТЬ СпрКОСГУ
	|ИЗ
	|	Справочник.КОСГУ КАК КОСГУ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КОСГУ.Ссылка,
	|	КОСГУ2.Родитель
	|ИЗ
	|	Справочник.КОСГУ КАК КОСГУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КОСГУ КАК КОСГУ2
	|		ПО КОСГУ.Родитель = КОСГУ2.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.КодСчета КАК КодСчета,
	|	Таб.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	Таб.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	Таб.КОСГУ КАК КОСГУ
	|ПОМЕСТИТЬ ТаблицаНастроекКОСГУ
	|ИЗ
	|	ВнешняяТаблицаНастроекКОСГУ КАК Таб";
	
	// при проверке РБ включаем в разрешенные записи также подчиненные КОСГУ
	Если ПроверкаРегистраБухгалтерии Тогда
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таб.КодСчета,
	|	Таб.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	Таб.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	СпрКОСГУ.Ссылка
	|ИЗ
	|	ВнешняяТаблицаНастроекКОСГУ КАК Таб
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СпрКОСГУ КАК СпрКОСГУ
	|		ПО Таб.КОСГУ = СпрКОСГУ.Родитель";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.КодСчета КАК КодСчета,
	|	Таб.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	Таб.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	Таб.КОСГУДт КАК КОСГУДт
	|ПОМЕСТИТЬ ТаблицаНастроекКОСГУДт
	|ИЗ
	|	ВнешняяТаблицаНастроекКОСГУДт КАК Таб";
	
	// при проверке РБ включаем в разрешенные записи также подчиненные КОСГУ
	Если ПроверкаРегистраБухгалтерии Тогда
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таб.КодСчета,
	|	Таб.ДатаНачалаДействия,
	|	Таб.ДатаОкончанияДействия,
	|	СпрКОСГУ.Ссылка
	|ИЗ
	|	ВнешняяТаблицаНастроекКОСГУДт КАК Таб
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СпрКОСГУ КАК СпрКОСГУ
	|		ПО Таб.КОСГУДт = СпрКОСГУ.Родитель";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.КодСчета КАК КодСчета,
	|	Таб.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	Таб.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	Таб.КОСГУКт КАК КОСГУКт
	|ПОМЕСТИТЬ ТаблицаНастроекКОСГУКт
	|ИЗ
	|	ВнешняяТаблицаНастроекКОСГУКт КАК Таб";
	
	// при проверке РБ включаем в разрешенные записи также подчиненные КОСГУ
	Если ПроверкаРегистраБухгалтерии Тогда
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таб.КодСчета,
	|	Таб.ДатаНачалаДействия,
	|	Таб.ДатаОкончанияДействия,
	|	СпрКОСГУ.Ссылка
	|ИЗ
	|	ВнешняяТаблицаНастроекКОСГУКт КАК Таб
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СпрКОСГУ КАК СпрКОСГУ
	|		ПО Таб.КОСГУКт = СпрКОСГУ.Родитель";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЕПСБУ.Ссылка КАК Счет,
	|	ТабНастроек.КОСГУ КАК КОСГУ
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаНастроекКОСГУ КАК ТабНастроек
	|		ПО (ПОДСТРОКА(ЕПСБУ.Код, 1, 6) = ТабНастроек.КодСчета
	|			И ЕПСБУ.ДатаНачалаДействия = ТабНастроек.ДатаНачалаДействия
	|			И ЕПСБУ.ДатаОкончанияДействия = ТабНастроек.ДатаОкончанияДействия)
	|ГДЕ
	|	ЕПСБУ.УчетПоКЭК
	|	И НЕ ЕПСБУ.ЭлементГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЕПСБУ.Ссылка КАК Счет,
	|	ТабНастроек.КОСГУДт КАК КОСГУДт
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаНастроекКОСГУДт КАК ТабНастроек
	|		ПО (ПОДСТРОКА(ЕПСБУ.Код, 1, 6) = ТабНастроек.КодСчета
	|			И ЕПСБУ.ДатаНачалаДействия = ТабНастроек.ДатаНачалаДействия
	|			И ЕПСБУ.ДатаОкончанияДействия = ТабНастроек.ДатаОкончанияДействия)
	|ГДЕ
	|	ЕПСБУ.УчетПоКЭК
	|	И НЕ ЕПСБУ.ЭлементГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЕПСБУ.Ссылка КАК Счет,
	|	ТабНастроек.КОСГУКт КАК КОСГУКт
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаНастроекКОСГУКт КАК ТабНастроек
	|		ПО (ПОДСТРОКА(ЕПСБУ.Код, 1, 6) = ТабНастроек.КодСчета
	|			И ЕПСБУ.ДатаНачалаДействия = ТабНастроек.ДатаНачалаДействия
	|			И ЕПСБУ.ДатаОкончанияДействия = ТабНастроек.ДатаОкончанияДействия)
	|ГДЕ
	|	ЕПСБУ.УчетПоКЭК
	|	И НЕ ЕПСБУ.ЭлементГруппа";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТаблицаНастроекКОСГУ", ТаблицаНастроекКОСГУ);
	Запрос.УстановитьПараметр("ТаблицаНастроекКОСГУДт", ТаблицаНастроекКОСГУДт);
	Запрос.УстановитьПараметр("ТаблицаНастроекКОСГУКт", ТаблицаНастроекКОСГУКт);
	
	Результат = Запрос.ВыполнитьПакет();
	ВсегоРезультатов = Результат.Количество();
	
	Возврат Новый Структура("ТаблицаСчетКОСГУ, ТаблицаСчетКОСГУДт, ТаблицаСчетКОСГУКт",
							Результат[ВсегоРезультатов-3].Выгрузить(),
							Результат[ВсегоРезультатов-2].Выгрузить(),
							Результат[ВсегоРезультатов-1].Выгрузить())
	
КонецФункции

Функция СформироватьТаблицуСчетДоходовРасходов_КОСГУ() Экспорт
	
	ТаблицаДоп = Новый ТаблицаЗначений;
	ТаблицаДоп.Колонки.Добавить("СчетКод", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(6)));
	ТаблицаДоп.Колонки.Добавить("КОСГУКод", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(3)));
	ТаблицаДоп.Колонки.Добавить("ДатаНачалаДействия", Новый ОписаниеТипов("Дата"));
	ТаблицаДоп.Колонки.Добавить("ДатаОкончанияДействия", Новый ОписаниеТипов("Дата"));
	
	УстановитьПривилегированныйРежим(Истина);
	Макет = РегистрыСведений.СоответствияАналитическихСчетовКЭК.ПолучитьМакет("НастройкиСоответствия");
	УстановитьПривилегированныйРежим(Ложь);
	
	СпСчетов = Макет.ПолучитьОбласть("Счета");
	КолВоСчетов = СпСчетов.ВысотаТаблицы + 1; // добавляем область "Неформат"
	
	Для а = 1 По КолВоСчетов Цикл
		Если а = КолВоСчетов Тогда
			ИмяОбластиСчета = "Неформат";
		Иначе
			ИмяОбластиСчета = "Сч"+СпСчетов.ПолучитьОбласть(а, 1).ТекущаяОбласть.Текст;
		КонецЕсли;
		СпНастроек = Макет.ПолучитьОбласть(ИмяОбластиСчета);
		Для б = 1 По СпНастроек.ВысотаТаблицы Цикл
			НоваяСтрока = ТаблицаДоп.Добавить();
			НоваяСтрока.СчетКод = СпНастроек.ПолучитьОбласть(б, 1).ТекущаяОбласть.Текст;
			НоваяСтрока.КОСГУКод = СпНастроек.ПолучитьОбласть(б, 4).ТекущаяОбласть.Текст;
			ДатаСтрокой = СпНастроек.ПолучитьОбласть(б, 2).ТекущаяОбласть.Текст;
			Если ЗначениеЗаполнено(ДатаСтрокой) Тогда
				НоваяСтрока.ДатаНачалаДействия = Дата(Сред(ДатаСтрокой, 7, 4) + Сред(ДатаСтрокой, 4, 2) + Лев(ДатаСтрокой, 2));
			Иначе
				НоваяСтрока.ДатаНачалаДействия = '00010101';
			КонецЕсли;
			ДатаСтрокой = СпНастроек.ПолучитьОбласть(б, 3).ТекущаяОбласть.Текст;
			Если ЗначениеЗаполнено(ДатаСтрокой) Тогда
				НоваяСтрока.ДатаОкончанияДействия = Дата(Сред(ДатаСтрокой, 7, 4) + Сред(ДатаСтрокой, 4, 2) + Лев(ДатаСтрокой, 2));
			Иначе
				НоваяСтрока.ДатаОкончанияДействия = '00010101';
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Таб.СчетКод КАК СчетКод,
	|	Таб.КОСГУКод КАК КОСГУКод,
	|	Таб.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	Таб.ДатаОкончанияДействия КАК ДатаОкончанияДействия
	|ПОМЕСТИТЬ ТабСчет_КОСГУ
	|ИЗ
	|	&ТаблицаДоп КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕПСБУ.Ссылка КАК СчетСсылка,
	|	КОСГУ.Ссылка КАК КОСГУСсылка
	|ПОМЕСТИТЬ ТабСчет_КОСГУСсылки
	|ИЗ
	|	ТабСчет_КОСГУ КАК ТабСчет_КОСГУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КОСГУ КАК КОСГУ
	|		ПО ТабСчет_КОСГУ.КОСГУКод = КОСГУ.Код
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ПО ТабСчет_КОСГУ.СчетКод = ЕПСБУ.Код
	|			И ТабСчет_КОСГУ.ДатаНачалаДействия = ЕПСБУ.ДатаНачалаДействия
	|			И ТабСчет_КОСГУ.ДатаОкончанияДействия = ЕПСБУ.ДатаОкончанияДействия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Таб.СчетСсылка КАК СчетСсылка,
	|	Таб.КОСГУСсылка КАК КОСГУСсылка
	|ПОМЕСТИТЬ ТабСчет_КОСГУСсылкиПодчиненные
	|ИЗ
	|	ТабСчет_КОСГУСсылки КАК Таб
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таб.СчетСсылка,
	|	КОСГУ.Ссылка
	|ИЗ
	|	ТабСчет_КОСГУСсылки КАК Таб
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КОСГУ КАК КОСГУ
	|		ПО (Таб.КОСГУСсылка = КОСГУ.Родитель
	|				ИЛИ Таб.КОСГУСсылка = КОСГУ.Родитель.Родитель)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕПСБУ.Ссылка КАК Счет,
	|	ЕПСБУ.Родитель КАК Родитель1,
	|	ЕПСБУ.Родитель.Родитель КАК Родитель2
	|ПОМЕСТИТЬ ТабСчетов
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				Таб.СчетСсылка
	|			ИЗ
	|				ТабСчет_КОСГУСсылки КАК Таб)
	|	И НЕ ЕПСБУ.ЭлементГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСчетов.Счет КАК Счет,
	|	ТабСчет_КОСГУСсылкиПодчиненные.КОСГУСсылка КАК КОСГУ
	|ИЗ
	|	ТабСчетов КАК ТабСчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабСчет_КОСГУСсылкиПодчиненные КАК ТабСчет_КОСГУСсылкиПодчиненные
	|		ПО (ТабСчетов.Счет = ТабСчет_КОСГУСсылкиПодчиненные.СчетСсылка
	|				ИЛИ ТабСчетов.Родитель1 = ТабСчет_КОСГУСсылкиПодчиненные.СчетСсылка
	|				ИЛИ ТабСчетов.Родитель2 = ТабСчет_КОСГУСсылкиПодчиненные.СчетСсылка)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТаблицаДоп", ТаблицаДоп);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СформироватьТаблицуКодовСчетовБУиАналитКодовВидовПоступленийВыбытий(НаДату) Экспорт
	
	ВидыКБКИзЭБ = Новый Соответствие;
	ВидыКБКИзЭБ.Вставить("Классификация расходов бюджета", Перечисления.ВидыКБК.КРБ);
	ВидыКБКИзЭБ.Вставить("Классификация доходов бюджета", Перечисления.ВидыКБК.КДБ);
	ВидыКБКИзЭБ.Вставить("Классификация источников внутреннего финансирования дефицитов бюджетов", Перечисления.ВидыКБК.КИФ);  
	ВидыКБКИзЭБ.Вставить("гКБК", Перечисления.ВидыКБК.гКБК);
	
	ПеречислениеКВД = Перечисления.КВД;
	
	ТаблицаДоп = Новый ТаблицаЗначений;
	ТаблицаДоп.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДоп.Колонки.Добавить("АналитКодБК", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(3)));
	ТаблицаДоп.Колонки.Добавить("КФО", Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаДоп.Колонки.Добавить("ВидПоказателя", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКБК"));
	ТаблицаДоп.Колонки.Добавить("КЭК", Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ТаблицаДоп.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ТаблицаДоп.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	
	УстановитьПривилегированныйРежим(Истина);
	Макет = Обработки.АудитСостоянияСистемыБГУ.ПолучитьМакет("СоответствиеКодовСчетовИВидовДоходовРасходов");
	УстановитьПривилегированныйРежим(Ложь);
	
	ПодчиненныеКОСГУ = Новый Соответствие;
	
	КоличествоСтрок = Макет.ВысотаТаблицы;
	Для ТекСтрока = 5 По КоличествоСтрок Цикл
		
		НомерСтроки = Формат(ТекСтрока, "ЧГ=");
		
		// Ниже пустой строки указаны комментарии по изменению оригинальной таблицы - выход из цикла
		Если Макет.Область("R"+НомерСтроки+"C1").Текст = "" Тогда
			Прервать;
		КонецЕсли;
		
		ВидКБК = ВидыКБКИзЭБ[Макет.Область("R"+НомерСтроки+"C6").Текст];
		
		ЧастиДатыНачала = СтрРазделить(Макет.Область("R"+НомерСтроки+"C7").Текст, ".", Ложь);
		Если ЧастиДатыНачала.Количество() = 0 Тогда
			ДатаНачала = Дата(1,1,1);
		Иначе
			ДатаНачала = Дата(ЧастиДатыНачала[2], ЧастиДатыНачала[1], ЧастиДатыНачала[0]);
		КонецЕсли;
		
		ЧастиДатыОкончания = СтрРазделить(Макет.Область("R"+НомерСтроки+"C8").Текст, ".", Ложь);
		Если ЧастиДатыОкончания.Количество() = 0 Тогда
			ДатаОкончания = НаДату;
		Иначе
			ДатаОкончания = Дата(ЧастиДатыОкончания[2], ЧастиДатыОкончания[1], ЧастиДатыОкончания[0]);
		КонецЕсли;
		
		КодСчета = Макет.Область("R"+НомерСтроки+"C3").Текст;
		КодСчета = Лев(КодСчета, 3) + "." + Прав(КодСчета, 2);
		Счет = БухгалтерскийУчет.СчетПоКоду(КодСчета, ДатаОкончания);
		
		Если Счет.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		АналитКодБК = Макет.Область("R"+НомерСтроки+"C2").Текст;
		
		МассивКФО = СтрРазделить(Макет.Область("R"+НомерСтроки+"C4").Текст, ",");
		МассивКОСГУ = СтрРазделить(Макет.Область("R"+НомерСтроки+"C5").Текст, ",");
		
		// Если КОСГУ = 000 и он в списке один, то добавляем допустимые оборотные КОСГУ (если применимо к счету)
		Если МассивКОСГУ.ВГраница() = 0 И МассивКОСГУ[0] = "000"
			И БухгалтерскийУчетПовтИсп.СчетаСОборотнымКЭК().Найти(Счет) <> Неопределено Тогда
			Для Каждого ДопустимыйКЭК ИЗ БухгалтерскийУчетПовтИсп.ДопустимыеКЭКСчета(Счет) Цикл
				МассивКОСГУ.Добавить(ДопустимыйКЭК.Код);
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого КОСГУ Из МассивКОСГУ Цикл
			Если КОСГУ = "000" Тогда
				Продолжить;
			ИначеЕсли ПодчиненныеКОСГУ.Получить(КОСГУ) = Неопределено Тогда
				Выборка = Справочники.КОСГУ.ВыбратьИерархически(БухгалтерскийУчетПовтИсп.КЭКПоКоду(КОСГУ));
				МассивПодчиненныхКОСГУ = Новый Массив;
				Пока Выборка.Следующий() Цикл
					МассивПодчиненныхКОСГУ.Добавить(Выборка.Ссылка);
				КонецЦикла;
				ПодчиненныеКОСГУ.Вставить(КОСГУ, МассивПодчиненныхКОСГУ);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого КФО Из МассивКФО Цикл
			КФОСсылка = ПеречислениеКВД.Получить(КФО-1);
			Для Каждого КОСГУ Из МассивКОСГУ Цикл
				
				НоваяСтрока = ТаблицаДоп.Добавить();
				НоваяСтрока.Счет = Счет;
				НоваяСтрока.АналитКодБК = АналитКодБК;
				НоваяСтрока.КФО = КФОСсылка;
				НоваяСтрока.ВидПоказателя = ВидКБК;
				НоваяСтрока.КЭК = БухгалтерскийУчетПовтИсп.КЭКПоКоду(КОСГУ);
				НоваяСтрока.ДатаНачала = ДатаНачала;
				НоваяСтрока.ДатаОкончания = ДатаОкончания;
				
				МассивПодчиненныхКОСГУ = ПодчиненныеКОСГУ.Получить(КОСГУ);
				Если МассивПодчиненныхКОСГУ = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Для Каждого ПодчиненныйКОСГУ Из МассивПодчиненныхКОСГУ Цикл
					НоваяСтрока = ТаблицаДоп.Добавить();
					НоваяСтрока.Счет = Счет;
					НоваяСтрока.АналитКодБК = АналитКодБК;
					НоваяСтрока.КФО = КФОСсылка;
					НоваяСтрока.ВидПоказателя = ВидКБК;
					НоваяСтрока.КЭК = ПодчиненныйКОСГУ;
					НоваяСтрока.ДатаНачала = ДатаНачала;
					НоваяСтрока.ДатаОкончания = ДатаОкончания;
				КонецЦикла;
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаДоп;
	
КонецФункции

Функция СформироватьТаблицуКВР_КОСГУ() Экспорт
	
	ТаблицаДоп = Новый ТаблицаЗначений;
	ТаблицаДоп.Колонки.Добавить("КВРКод", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(3)));
	ТаблицаДоп.Колонки.Добавить("КОСГУКод", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(3)));
	
	УстановитьПривилегированныйРежим(Истина);
	Макет = Обработки.АудитСостоянияСистемыБГУ.ПолучитьМакет("СоответствиеВидовРасходовКРБиКОСГУ");
	УстановитьПривилегированныйРежим(Ложь);
	
	КоличествоСтрок = Макет.ВысотаТаблицы;
	Для ТекСтрока = 2 По КоличествоСтрок Цикл
		НоваяСтрока = ТаблицаДоп.Добавить();
		НоваяСтрока.КВРКод = Макет.Область("R"+ТекСтрока+"C1").Текст;
		НоваяСтрока.КОСГУКод = Макет.Область("R"+ТекСтрока+"C2").Текст;
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Таб.КВРКод КАК КВРКод,
	|	Таб.КОСГУКод КАК КОСГУКод
	|ПОМЕСТИТЬ ТабКВР_КОСГУ
	|ИЗ
	|	&ТаблицаДоп КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОСГУ.Ссылка КАК Ссылка,
	|	КОСГУ.Код КАК Код,
	|	КОСГУ.Родитель КАК Родитель,
	|	КОСГУ.Родитель.Код КАК РодительКод,
	|	КОСГУ.Родитель.Родитель.Код КАК РодительРодительКод
	|ПОМЕСТИТЬ СпрКОСГУ
	|ИЗ
	|	Справочник.КОСГУ КАК КОСГУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабКВР_КОСГУ.КВРКод КАК КВРКод,
	|	СпрКОСГУ.Ссылка КАК КОСГУ
	|ИЗ
	|	ТабКВР_КОСГУ КАК ТабКВР_КОСГУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СпрКОСГУ КАК СпрКОСГУ
	|		ПО ТабКВР_КОСГУ.КОСГУКод = СпрКОСГУ.Код
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабКВР_КОСГУ.КВРКод,
	|	СпрКОСГУ.Ссылка
	|ИЗ
	|	ТабКВР_КОСГУ КАК ТабКВР_КОСГУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СпрКОСГУ КАК СпрКОСГУ
	|		ПО ТабКВР_КОСГУ.КОСГУКод = СпрКОСГУ.РодительКод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабКВР_КОСГУ.КВРКод,
	|	СпрКОСГУ.Ссылка
	|ИЗ
	|	ТабКВР_КОСГУ КАК ТабКВР_КОСГУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СпрКОСГУ КАК СпрКОСГУ
	|		ПО ТабКВР_КОСГУ.КОСГУКод = СпрКОСГУ.РодительРодительКод";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТаблицаДоп", ТаблицаДоп);
	мТаблицаКВР_КОСГУ = Запрос.Выполнить().Выгрузить();
	
	Возврат мТаблицаКВР_КОСГУ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗарегистрироватьПроверкиСостоянияСистемы");
КонецПроцедуры

#КонецОбласти
